#ifndef __ENCODER_H__
#define __ENCODER_H__

/*---------------------------------------------------
Энкодер: Канал A - PD0 (INT0)
         Канал B - PD1 (INT1)
    Кнопка: INT2
-----------------------------------------------------*/

//INCLUDE
#include "common.h"
//-------------------------------------------------------
//DEFINE
#define INTERRUPT_ENCODER EICRA |= (1<<ISC00) | (1<<ISC01) | (1<<ISC21) // Нарастающий фронт на INT0 на INT2
#define ALLOW_INTERRUPT_ENCODER EIMSK |= (1<<INT0) | (1<<INT2) // Разрешить прерывание от INT0 и INT2
//-------------------------------------------------------

//FUNCTION
void init_encoder (); // Инициализация энкодера и кнопки
//-------------------------------------------------------

#endif 